Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_193-The_Prophecy_of_Sri_Mahadevi-v1.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas.

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་བདེ་བ་ཅན་ན་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཆེན་པོ་འདི་ལྟ་སྟེ།
en: The Bhagavān was dwelling in Sukhāvatī together with the great saṅgha of bodhisattvas,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་།
en: Bodhisattva Mahāsattva Ārya Avalokiteśvara,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཐུ་ཆེན་ཐོབ་པ་དང་།
en: Bodhisattva Mahāsattva Mahā­sthāma­prāpta,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་དང་།
en: Bodhisattva Mahāsattva Sarva­nīvaraṇa­viṣkaṃbhin,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སའི་སྙིང་པོ་དང་།
en: Bodhisattva Mahāsattva Kṣitigarbha,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོ་དང་།
en: Bodhisattva Mahāsattva Samantabhadra,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོ་དང་།
en: Bodhisattva Mahāsattva Ākāśagarbha,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇིགས་པ་ཐམས་ཅད་སེལ་བ་དང་།
en: Bodhisattva Mahāsattva Vajrapāṇi and Bodhisattva Sarvabhayahara,

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགའ་བྱེད་ཀྱི་བཀྲ་ཤིས་ཐམས་ཅད་འཛིན་པ་དང་།
en: and similarly Bodhisattva Mahāsattva Sarva­maṅgala­dhārin,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསོད་ནམས་ཀྱི་མཚན་ཐམས་ཅད་འཛིན་པ་དང་།
en: Bodhisattva Mahāsattva Sarva­puṇya­lakṣaṇa­dhārin,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉི་ཟླ་དང་འཇིག་རྟེན་གསུམ་འཛིན་པ་དང་།
en: Bodhisattva Mahāsattva Candra­sūrya­trailokya­dhārin,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མུ་སྟེགས་ཀྱི་བཀྲ་ཤིས་ཐམས་ཅད་འཛིན་པ་དང་།
en: Bodhisattva Mahāsattva Sarva­tīrtha­maṅgala­dhārin,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་།
en: Bodhisattva Mahāsattva Mañjuśrī Kumārabhūta.

source: དེ་དག་ལ་སོགས་པ་བསྐལ་པ་བཟང་པོའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་ཐམས་ཅད་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ།
en: amongst them the following bodhisattva mahāsattvas of the excellent eon

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Then Bodhisattva Mahāsattva Avalokiteśvara went to the place where the Bhagavān was, paid homage at the Bhagavān’s feet, and remained at one side.

source: །ལྷ་མོ་ཆེན་མོ་དཔལ་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་
en: Mahādevī also went toward the Bhagavān, paid homage at his feet, and circumambulated him three times.

source: ནས་བདེ་བ་ཅན་ན་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཐམས་ཅད་ལ་ཡང་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Then she also paid homage to all the bodhisattva mahāsattvas who were dwelling in Sukhāvati and remained at one side.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་བསོད་ནམས་བརྒྱ་སྟོང་དུ་མས་བརྒྱན་ཅིང་དེ་བཞིན་གཤེགས་པ་བྱེ་བ་སྙེད་ཀྱིས་ཡོངས་སུ་བསྐོར་ཏེ།
en: The Bhagavān was adorned with many hundreds of thousands of merits and surrounded by as many as ten million tathāgatas.

source: བརྒྱ་བྱིན་དང་ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་ཐམས་ཅད་ཀྱིས་བསྟོད་ཅིང་བསྔགས་པས་
en: As Indra, Brahmā and the guardians of the world all offered their praises and acclaim,

source: ལྷ་མོ་ཆེན་མོ་དཔལ་ལ་གཟིགས་ནས། ཚངས་པ་ཆེན་པོའི་གསུང་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: the Bhagavān, having gazed at Śrī Mahādevī, addressed Bodhisattva Mahāsattva Avalokiteśvara as follows in his Great Brahmā voice:

source: །སྤྱན་རས་གཟིགས་དབང་ཕྱུག་རྒྱལ་པོའམ། བློན་པོའམ། དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མའམ། བྲམ་ཟེའམ། རྒྱལ་རིགས་སམ། རྗེའུ་རིགས་སམ། དམངས་རིགས་གང་ལ་
en: “Avalokiteśvara, if any one of the kings, ministers, bhikṣus, bhikṣuṇīs, upāsakas, upāsikās, brāhmaṇas, kṣatriyas, vaiśyas or śūdras

source: ལྷ་མོ་ཆེན་མོ་དཔལ་གྱི་མིང་བརྒྱ་རྩ་བརྒྱད་དྲི་མ་མེད་པར་གྲགས་པ་ཞེས་བྱ་བའི་བསྟོད་པ་འདི་འཆང་ན།
en: retains this praise “The One Hundred and Eight Names of Śrī Mahādevī which are Renowned as Stainless,”

source: རྒྱལ་རིགས་ཀྱི་རྒྱལ་པོ་དེའི་ཡུལ་དང་། སེམས་ཅན་དེ་དག་གི་འཇིགས་པ་དང་། ཡམས་ཀྱི་ནད་དང་། གནོད་པ་ཐམས་ཅད་ཞི་བར་འགྱུར་ཞིང་།
en: then the kṣatriya king’s kingdom, the fears of those beings there, as well as the epidemics and harmful influences will all be pacified, and

source: ཆོམ་རྐུན་དང་། གཡོན་ཅན་དང་། མི་དང་མི་མ་ཡིན་པའི་འཇིགས་པ་ཐམས་ཅད་འབྱུང་བར་མི་འགྱུར་ཏེ།
en: no one at all will fear robbers, rogues, humans or nonhumans.

source: ནོར་དང་། འབྲུ་དང་། མཛོད་དང་། བང་བ་ཐམས་ཅད་རྣམ་པར་འཕེལ་བར་འགྱུར་རོ།
en: Wealth, grains, treasuries and stores will all increase,

source: །རྒྱལ་རིགས་ཀྱི་རྒྱལ་པོ་དེའི་ཁྱིམ་དུ་ཡང་དཔལ་ངེས་པར་གནས་པར་འགྱུར་རོ།
en: and the Glorious Mahādevī will no doubt abide in the home of this kṣatriya king.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་ཚིག་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཚིག་འདི་ལེགས་པར་བཀའ་སྩལ་པ། ལེགས་སོ་ལེགས་སོ།
en: Then those bodhisattva mahāsattvas said, “Bhagavāṇ, these words are well said. Excellent! Excellent!

source: །གང་དག་ལྷ་མོ་ཆེན་མོ་དཔལ་གྱི་མིང་རྣམས་འཛིན་པ་དང་། ཐོས་ནས་ཉམས་སུ་ལེན་པ་གང་ལགས་པ་དེ་དག་གི་ཡོན་ཏན་དང་ཕན་ཡོན་ནི་དེ་དག་ཏུ་འགྱུར་ལགས་སོ།
en: Those people who will retain the names of Śrī Mahādevī and who will put them into practice once they have heard them will have those aforementioned qualities and benefits.”

source: སྤྱན་རས་གཟིགས་དབང་ཕྱུག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་
en: O Avalokiteśvara, previously, in the past

source: འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་ལས་བྱུང་བ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་མེ་ཏོག་ཡོན་ཏན་གྱི་རྒྱ་མཚོ་བཻ་དཱུརྱ་དང་གསེར་གྱི་རི་བོ་མདོག་མཛེས་གསེར་འོད་དཔལ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: in a world system called Ratna­saṃbhavā, the tathāgata called Ratna­kusuma­guṇa­sāgara­vaiḍūrya­kanaka­giri­suvarṇa­kāṃcana­prabhāsa­śrī came forth into the world.

source: དེ་དང་དེ་བཞིན་གཤེགས་པ་མང་པོ་གཞན་དག་ལ་ཡང་ལྷ་མོ་ཆེན་མོ་དཔལ་གྱིས་དགེ་བའི་རྩ་བ་བསྐྱེད་དོ།
en: Śrī Mahādevī generated roots of virtue in his presence and in the presence of many other tathāgatas, too.

source: །དེ་བཞིན་གཤེགས་པའི་མཚན་འདི་དག་ཀྱང་ལྷ་མོ་ཆེན་མོ་དཔལ་དེའི་དགེ་བའི་རྩ་བ་རྣམ་པར་འཕེལ་བ་དང་། འགྲུབ་པར་བྱེད་པ་དང་།
en: Now, the names of the tathāgatas make Śrī Mahādevī’s roots of virtue flourish and come to fulfillment.

source: རྟག་ཏུ་རྗེས་སུ་འབྲང་བ་ཡིན་ཏེ། དེ་དག་ནི་འདིར་ལྷ་མོ་ཆེན་མོ་དཔལ་གྱིས་ཡང་དག་པར་བརྗོད་པ་དང་།
en: They stay with her always, these names which here in this world Śrī Mahādevī recites precisely and

source: སྡིག་པ་ཐམས་ཅད་སེལ་བ་དང་། ཉེས་སྡིག་ཐམས་ཅད་མེད་པར་བྱེད་པ་དང་། ལུས་ཐམས་ཅད་དྲི་མ་མེད་པར་བྱེད་པ་དང་། ནོར་དང་འབྲུ་རྣམས་འདུ་ཞིང་འཕེལ་བར་བྱེད་པ་དང་། དབུལ་བ་གཅོད་པར་བྱེད་པ་དང་།
en: which dispel all sins, eliminate all offenses, make all effects stainless, gather and increase wealth and grains, eradicate poverty,

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་ཐམས་ཅད་འདུན་པར་བྱེད་ཅིང་འགུགས་པར་བྱེད་པ་དང་།
en: attract and catch the attention of all gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, and mahoragas,

source: ཡམས་ཀྱི་ནད་དང་། གནོད་པ་དང་། འཐབ་པ་དང་། འཁྲུག་པ་དང་། འགྱེད་པ་དང་། རྩོད་པ་ཐམས་ཅད་ཞི་བར་བྱེད་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་རྫོགས་པར་བྱེད་པའོ།
en: pacifying all epidemics, natural misfortunes, disputes, conflicts, dissensions, and arguments, and which will bring the six perfections to fulfilment.

source: །འདི་ལྟ་སྟེ།
en: They are as follows:

source: དེ་བཞིན་གཤེགས་པ་དཔལ་སྟུག་པ་པོ་ལ་ཕྱག་འཚལ་ལོ།
en: “Homage to Tathāgata Śrīghana.

source: །དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་མེ་ཏོག་ཡོན་ཏན་གྱི་རྒྱ་མཚོ་བཻ་དཱུརྱ་དང་གསེར་གྱི་རི་བོ་མདོག་མཛེས་གསེར་འོད་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Ratna­kusuma­guṇa­sāgara­vaiḍūrya­kanaka­giri­suvarṇa­kāṃcana­prabhāsa­śrī.

source: །དེ་བཞིན་གཤེགས་པ་གང་གཱའི་མུ་སྟེགས་ཀྱི་སྒོ་ཐམས་ཅད་ཀྱི་བཀྲ་ཤིས་ཀྱི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Gaṅgāsarva­tīrthamukha­maṅgala­śrī.

source: །དེ་བཞིན་གཤེགས་པ་ཙན་དན་གྱི་མེ་ཏོག་གཟི་བརྗིད་སྐར་མའི་འོད་ཀྱི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Candana­kusuma­tejo­nakṣatra­prabhāsa­śrī.

source: །དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་སྣང་བ་གཡུལ་ལས་རྣམ་པར་རྒྱལ་བའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Samantāvabhāsa­vijita­saṃgrāma­śrī.

source: །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་རྒྱ་མཚོ་སྣང་བའི་དཀྱིལ་འཁོར་གྱི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Guṇa­samudrāvabhāsa­maṇḍala­śrī.

source: །དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་ཆོ་འཕྲུལ་རྒྱལ་མཚན་ཤུགས་ཀྱི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Dhārma­vikurvaṇa­dhvaja­vega­śrī.

source: །དེ་བཞིན་གཤེགས་པ་སྐར་འོད་ཞི་བའི་སྤོས་སྣང་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Jyotiḥsaumya­gandhāvabhāsa­śrī.

source: །དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་གྱི་བསམ་པ་ཞི་བར་མཛད་པའི་སྐུའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Sattvāśaya­śamana­śarīra­śrī.

source: །དེ་བཞིན་གཤེགས་པ་སྨོན་ལམ་རྒྱ་མཚོས་སྣང་བའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Praṇidhāna­sāgarāvabhāsa­śrī.

source: །དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་ཡོངས་སུ་བརྗོད་པ་མཚན་གསོལ་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Su­parikīrtita­nāmadheya­śrī.

source: །དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་གྲངས་མེད་པ་ལ་རབ་ཏུ་ཞུགས་པའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Asaṃkhyeya­vīrya­susaṃprasthita­śrī.

source: །དེ་བཞིན་གཤེགས་པ་ཤེས་རབ་སྒྲོན་མ་གྲངས་མེད་པའི་འོད་ཀྱི་མེ་ཏོག་གི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Prajñā­pradīpāsaṃkhyeya­prabhā­ketu­śrī.

source: །དེ་བཞིན་གཤེགས་པ་སྲེད་མེད་ཀྱི་བུའི་བརྟུལ་ཞུགས་ཀྱི་གོ་ཆ་རི་རབ་ཀྱི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Nārāyaṇa­vrata­sannāha­sumeru­śrī.

source: །དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Brahmaśrī.

source: །དེ་བཞིན་གཤེགས་པ་དབང་ཕྱུག་ཆེན་པོའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Maheśvaraśrī.

source: །དེ་བཞིན་གཤེགས་པ་ཉི་ཟླའི་འོད་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Candrasūryaśrī.

source: །དེ་བཞིན་གཤེགས་པ་ཟབ་མོའི་ཆོས་ཀྱི་འོད་ཀྱི་རྒྱལ་པོའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Gambhīra­dharma­prabhā­rāja­śrī.

source: །དེ་བཞིན་གཤེགས་པ་ནམ་མཁའི་སྒྲོན་མའི་འོད་བཟང་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Gagana­pradīpābhirāma­śrī.

source: །དེ་བཞིན་གཤེགས་པ་ཉི་འོད་ཏོག་གི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Sūrya­prabhā­ketu­śrī.

source: །དེ་བཞིན་གཤེགས་པ་སྤོས་ཀྱི་སྒྲོན་མའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Gandha­pradīpa­śrī.

source: །དེ་བཞིན་གཤེགས་པ་རྒྱ་མཚོའི་སྙིང་པོ་ལས་བྱུང་བའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Sāgara­garbha­saṃbhava­śrī.

source: །དེ་བཞིན་གཤེགས་པ་གསུང་གི་ཡན་ལག་ཐམས་ཅད་ཀྱི་སྒྲ་དབྱངས་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Sarva­svarāṅga­ruta­nirghoṣa­śrī.

source: །དེ་བཞིན་གཤེགས་པ་དཔག་ཏུ་མེད་པའི་གསེར་མདོག་སྣང་བའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Aprameya­suvarṇotta­prabhāsa­śrī.

source: །དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྣང་བ་ཐམས་ཅད་བཀོད་པའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Sarva­dharma­prabhāsa­vyūha­śrī.

source: །དེ་བཞིན་གཤེགས་པ་ཤིང་གི་རྒྱལ་པོ་ལྟར་སྐྱེས་པའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Druma­rāja­vivardhita­śrī.

source: །དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འོད་འཕྲོ་རི་བོའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Ratnārciḥparvata­śrī.

source: །དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་འོད་འཕྲོ་རྒྱ་མཚོའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Jñānārciḥsāgara­śrī.

source: །དེ་བཞིན་གཤེགས་པ་སྤྲིན་ཆེན་པོའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Mahāmeghaśrī.

source: །དེ་བཞིན་གཤེགས་པ་སྨོན་ལམ་ཆེན་པོའི་ཤུགས་ཀྱི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Mahā­praṇidhi­vega­śrī.

source: །དེ་བཞིན་གཤེགས་པ་དྲན་པའི་ཏོག་གི་རྒྱལ་པོའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Smṛtiketu­rāja­śrī.

source: །དེ་བཞིན་གཤེགས་པ་དབང་པོའི་ཏོག་གི་རྒྱལ་མཚན་གྱི་རྒྱལ་པོའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Indra­ketu­dhvaja­rāja­śrī.

source: །དེ་བཞིན་གཤེགས་པ་ནོར་དང་འབྲུ་ཐམས་ཅད་སྡུད་པའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Sarva­dhana­dhānyākarṣaṇa­śrī.

source: །དེ་བཞིན་གཤེགས་པའི་མཚན་འདི་དག་རིམ་གྲོར་བྱས་ཏེ། བཅང་བར་བྱའོ། ། བཀླག་པར་བྱའོ།
en: “Having treated these names of tathāgatas with veneration, one should retain and recite them,

source: །དེ་ལྟར་བྱས་ན་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་ལ་བསོད་ནམས་ཤིན་ཏུ་མང་དུ་འཕེལ་བར་འགྱུར་རོ།
en: in this way the merit of a son or daughter of a noble family will increase immensely.

source: །དེ་བཞིན་གཤེགས་པ་ཞི་བ་འདྲེན་པའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Saumyākarṣaṇa­śrī.

source: །དེ་བཞིན་གཤེགས་པ་ཕུན་སུམ་ཚོགས་པ་འགུགས་པའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Lakṣmyākarṣaṇa­śrī.

source: །དེ་བཞིན་གཤེགས་པ་སྤྲུལ་པའི་འབྲུག་སྒྲ་སྙན་པའི་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Tathāgata Nirmita­megha­garjanayaśaḥ­śrī.

source: །ལྷ་མོ་ཆེན་མོ་དཔལ་ཡང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ཀྱང་ལུང་བསྟན་ཏོ།
en: “Now, all the tathāgatas made the following prophecies concerning Śrī Mahādevī:

source: །ལྷ་མོ་ཆེན་མོ་དཔལ་ཁྱོད་མ་འོངས་པའི་དུས་ན་
en: ‘Śrī Mahādevī, in the future

source: འཇིག་རྟེན་གྱི་ཁམས་དཔལ་རིན་པོ་ཆེས་བརྒྱན་པ་ཞེས་བྱ་བར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དཔལ་ནོར་བུ་རིན་པོ་ཆེ་ལས་བྱུང་བ་ཞེས་བྱ་བར་འགྱུར་ཏེ།
en: you will become the tathāgata, the arhat, the truly complete buddha called Śrī­maṇi­ratna­sambhava in the world system called Śrī­mahā­ratna­pratimaṇḍitā.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ཡང་ལྷའི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པར་འགྱུར་རོ།
en: And that world system will be adorned with various sorts of divine jewels.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེར་དེ་བཞིན་གཤེགས་པ་དེ་ཉིད་སྣང་བར་མཛད་པར་འགྱུར་ལ་
en: This very tathāgata will spread light in that world system,

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཀྱང་རང་ལས་འོད་འབྱུང་ཞིང་ཚེ་དཔག་ཏུ་མེད་པར་འགྱུར་རོ།
en: those bodhisattvas dwelling there in that world will spontaneously become radiant and have immeasurable life spans.

source: །ནམ་མཁའ་ལས་ཀྱང་སངས་རྒྱས་དང་། ཆོས་དང་དགེ་འདུན་གྱི་སྒྲ་འབྱུང་བར་འགྱུར་རོ།
en: The word buddha­dharma­saṅgha will also come down from the sky,

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེར་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་སྐྱེ་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་པད་མའི་སྙིང་པོ་དག་ལས་སྐྱེ་བར་འགྱུར་རོ་ཞེས་
en: the bodhisattvas who will be born in that buddha field will all be born from the centers of lotuses.’

source: །དེ་ལ་མིང་བརྒྱ་རྩ་བརྒྱད་དྲི་མ་མེད་པར་གྲགས་པ་ཞེས་བྱ་བའི་བསྟོད་པ་བརྒྱད་ཅུ་གཉིས་པ་གང་ཞེ་ན།
en: “What is the twelve-line praise with one hundred and eight names that is renowned as being stainless?

source: འཇིགས་པ་མེད་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལྷ་མོ་ཆེན་མོ་དཔལ་གྱི་མིང་རྣམས་ཉོན་ཅིག །འདི་ལྟ་སྟེ།
en: “O fearless Avalokiteśvara, please hearken to the names of Śrī Mahādevī. They are as follows:

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་དབང་བསྐུར་བ།
en: Sarva­tathāgatābhiṣiktā (She who was Empowered by All Tathāgatas)

source: ལྷ་ཐམས་ཅད་ཀྱིས་དབང་བསྐུར་བ།
en: Sarva­devatābhiṣiktā (She who was Empowered by All Gods)

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུམ།
en: Sarva­tathāgata­mātṛ (Mother of All Tathāgatas)

source: ལྷ་ཐམས་ཅད་ཀྱི་མ།
en: Sarva­devatā­mātṛ (Mother of All Gods)

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དཔལ།
en: Sarva­tathāgata­śrī (Glory of All Tathāgatas)

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་དཔལ།
en: Sarva­bodhisattva­śrī (Glory of All Bodhisattvas)

source: འཕགས་པ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་དཔལ།
en: Sarvārya­śrāvaka­pratyeka­buddha­śrī (Glory of All Āryaśrāvakas and Pratyekabuddhas)

source: ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་ཆེན་པོ་ཐམས་ཅད་ཀྱི་དཔལ།
en: Brahma­viṣṇu­maheśvara­śrī (Glory of Brahmā, Viṣṇu and Maheśvara)

source: གནས་ཐམས་ཅད་ན་ཡོད་པའི་དཔལ།
en: Mahā­sthāna­gata­śrī (Glory Present in Great Places)

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་ཐམས་ཅད་ཀྱི་དཔལ།
en: Sarva­deva­nāga­yakṣa­gandharvāsura­garuḍa­kiṃnara­mahoraga­śrī (Glory of All the Gods, Nāgas, Yakṣas, Gandharvas, Asuras, Garuḍas, Kiṃnaras and Mahoragas)

source: ལྷ་ལ་སོགས་པ་ཐམས་ཅད་ཀྱི་དཔལ།
en: Sarva­devatābhimukha­śrī (Glory in the Presence of all Gods)

source: རིག་སྔགས་འཆང་དང་། ལག་ན་རྡོ་རྗེ་དང་། རྡོ་རྗེ་འཆང་བ་ཐམས་ཅད་ཀྱི་དཔལ།
en: Sarva­vidyā­dhara­vajra­pāṇi­vajra­dhara­śrī (Glory of All the Vidyādharas, Vajrapāṇi and Vajradharas)

source: འཇིག་རྟེན་སྐྱོང་བ་བཞི་དང་ལྔའི་དཔལ།
en: Catuḥpañca­lokapāla­śrī (Glory of the Four and the Five Guardians of the World)

source: གཟའ་བརྒྱད་དང་། རྒྱུ་སྐར་ཉི་ཤུ་རྩ་བརྒྱད་ཀྱི་དཔལ་ལོ།
en: Aṣṭa­grahāṣṭāviṃśati­nakṣatra­śrī (Glory of the Eight Planets and Twenty-Eight Constellations)

source: །ཨོཾ་ཉི་མའི་བུ་མོ།
en: Oṃ Sāvitrī (Daughter of Savitra)

source: མ་མ་ཡུམ།
en: Mātṛ (Mother)

source: རིག་བྱེད་བཞིའི་དཔལ།
en: Caturvedaśrī (Glory of the Four Vedas)

source: བཀྲ་ཤིས་མ། སེམས་ཅན་རྣམས་ཀྱི་མ། རྒྱལ་མ། རྣམ་རྒྱལ་མ། གང་གཱ་མ། མུ་སྟེགས་ཀྱི་སྒོ་ཐམས་ཅད་ཀྱི་བཀྲ་ཤིས་མ།
en: Bhūtamātṛ (Mother of Sentient Beings), Jayā (She who is Victorious), Vijayā (She who Conquers), Gaṅgā (She who is the Ganges), Sarvatīrthā (She of All Holy Places), Sarvamaṅgalyā (She who Confers All Auspiciousness)

source: དྲི་མ་མེད་པ། དྲི་མ་མེད་པར་བྱེད་པའི་དཔལ།
en: Vimala­nirmala­kara­śrī (Glory that Makes One Stainless and Pure)

source: སྡིག་པ་ཐམས་ཅད་འཕྲོག་མ།
en: Sarva­pāpa­hantrī (She who Slays All Sins)

source: རྒྱགས་པ་མེད་པ།
en: Nirmadakarā (She who Humbles)

source: ཟླ་བའི་དཔལ། ཉི་མའི་དཔལ། ཟླ་ཐམས་ཅད་ཀྱི་དཔལ།
en: Candraśrī (Glory of the Moon), Sūryaśrī (Glory of the Sun), Sarvagrahaśrī (Glory of All the Planets)

source: སེང་གེ་ལ་ཞོན་མ།
en: Siṃhavāhinī (She who Rides upon a Lion)

source: པད་མའི་མཆོག་འབུམ་གྱིས་བཀབ་མ། པད་མ་པད་མ་ལ་གནས་པ། པད་མ་འཛིན་པ། པད་མ་ལས་བྱུང་མ། པད་མ་དང་ལྡན་པ།
en: Śata­sahasra­koṭipadma­vivara­saṃcchannā (She who is Enveloped by a Display of One Hundred Thousand Crore Lotuses), Padmā (She who has Lotuses), Padmasambhavā (She who was Born from a Lotus), Padmālayā (She whose Abode is a Lotus), Padmadharā (She who Holds a Lotus), Padmāvatī (She who is Endowed with Lotuses)

source: འོད་ཟེར་འབར་བ་དུ་མས་འཁོར་བ། ནོར་སྦྱིན་མ།
en: Aneka­ratnāṃśu­mālā (She who has a Garland of Many Light Rays that are like Jewels), Dhanadā (She who Brings Wealth)

source: དཀར་མོ། དཀར་མོ་ཆེན་མོ། ལག་དཀར་མ།
en: Śvetā (Fair One), Mahāśvetā (Great Fair One), Śvetabhujā (She who has Fair Arms)

source: བཀྲ་ཤིས་ཐམས་ཅད་འཛིན་མ། བསོད་ནམས་ཀྱི་ཕུང་པོ་ཐམས་ཅད་ཀྱི་ལུས་ཅན།
en: Sarva­maṅgala­dhāriṇī (She who Possesses All Auspiciousness), Sarva­puṇyopacitāṅgī (She whose Body Consists of All Collections of Merit)

source: ཤེས་ཉེན་ཅན་གྱི་བུ་མོ།
en: Dākṣāyaṇī (Daughter of Dakṣa)

source: ལག་པ་འབུམ་དང་ལྡན་མ། མིག་འབུམ་དང་ལྡན་མ། མགོ་འབུམ་དང་ལྡན་མ།
en: Śata­sahasra­bhujā (She who has One Hundred Thousand Arms), Śata­sahasra­nayanā (She who has One Hundred Thousand Eyes), Śata­sahasra­śirā (She who has One Hundred Thousand Heads)

source: ནོར་བུ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་མཛེས་པར་བྱས་པའི་ཅོད་པན་ཐོགས་པ།
en: Vividha­vicitra­maṇi­mauli­dharā (She who Bears a Diadem of Many Sorts of Multicolored Jewels)

source: གཟུགས་བཟང་བ། གཟུགས་སྣ་ཚོགས་ཅན།
en: Surūpā (She who has a Beautiful Form), Viśvarūpā (She who has All Different Forms)

source: རབ་གྲགས་མ། ཤིན་ཏུ་གྲགས་མ།
en: Yaśā (Renowned One), Mahāyaśā (Highly Renowned One)

source: ཞི་བ་མ།
en: Saumyā (Benign One)

source: སྤྲིན་མ།
en: Bahujīmūtā (She of the Many Clouds)

source: སྐྲ་གཙང་མ།
en: Pavitrakeśā (She whose Hair is Purity)

source: ཟླ་བ་ལྟར་མཛེས་མ། ཉི་མ་ལྟར་མཛེས་མ།
en: Candrakāntā (She who is Lovely like the Moon), Sūryakāntā (She who is Lovely like the Sun)

source: དགེ་མ། དགེ་བྱེད་མ།
en: Śubhā (Virtuous One), Śubhakartrī (She who Brings About Virtue)

source: སེམས་ཅན་ཐམས་ཅད་ལ་མངོན་དུ་ཕྱོགས་མའི་དཔལ།
en: Sarva­sattvābhimukhī (She who is Disposed towards All Sentient Beings)

source: འཕགས་མ།
en: Āryā (Noble One)

source: མེ་ཏོག་ལ་གནས་མ། མེ་ཏོག་གི་དབང་ཕྱུག་མ།
en: Kusumaśrī (Glory of the Flowers), Kusumeśvarā (She who is the Sovereign of the Flowers)

source: རི་བོའི་རྒྱལ་པོ་རི་རབ་ཐམས་ཅད་ཀྱི་དཔལ།
en: Sarva­sumeru­parvata­rāja­śrī (Glory of the Entire King of Mountains, Mt. Sumeru)

source: ཆུ་ཀླུང་དང་། མཚོ་ཐམས་ཅད་ཀྱི་དཔལ། ཆུ་ཐམས་ཅད་ཀྱི་རྒྱ་མཚོའི་དཔལ།
en: Sarva­nadī­saricchrī (Glory of All Rivers and Streams), Sarva­toya­samudra­śrī (Glory of the Ocean of All Waters)

source: མུ་སྟེགས་ཐམས་ཅད་དུ་མངོན་དུ་ཕྱོགས་པའི་དཔལ།
en: Sarva­tīrthābhimukha­śrī (Glory of Turning Towards All the Holy Places)

source: སྨན་དང་། རྩི་ཏོག་དང་། ཤིང་དང་། ནོར་དང་། འབྲུ་ཐམས་ཅད་ཀྱི་དཔལ།
en: Sarvauṣadhi­tṛṇa­vanaspati­dhana­dhānya­śrī (Glory of All Medicinal Herbs, Grasses, Trees, Wealth and Grains)

source: གསེར་སྦྱིན་མ།
en: Hiraṇyadā (She who Gives Gold)

source: ཟས་དང་གོས་སྦྱིན་མ།
en: Annapānadā (She who Gives Food and Drink)

source: འོད་གསལ་མ། སྣང་བ་མ།
en: Prabhāsvarā (She of the Clear Light), Ālokakarā (She who Illuminates)

source: ལུས་གཙང་མ།
en: Pavitrāṅgā (She of the Pure Body)

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དབང་སྒྱུར་མ།
en: Sarva­tathāgata­vaśavartinī (She who has Power over All Tathāgatas)

source: ལྷའི་ཚོགས་ཐམས་ཅད་ལ་མངོན་དུ་ཕྱོགས་པའི་དཔལ།
en: Sarva­deva­gaṇa­mukha­śrī (Glory when in the Presence of the Entire Assembly of the Gods)

source: གཤིན་རྗེ་དང་། ཆུ་ལྷ་དང་། ཀུ་བེ་ར་དང་། བརྒྱ་བྱིན་ལ་སོགས་པའི་དཔལ།
en: Yama­varuṇa­kubera­vāsava­śrī (Glory of Yama, Varuṇa, Kubera and Vāsava)

source: སྦྱིན་པ་མ།
en: Dātrī (She who Gives)

source: ལོངས་སྤྱོད་མ།
en: Bhoktrī (She who Takes Pleasure)

source: གཟི་བརྗིད་ལྡན་མ།
en: Tejā (She who is Brilliance)

source: ཕུན་སུམ་ཚོགས་མ།
en: Vibhūtī (Abundance)

source: རྣམ་པར་སྐྱེ་བ་མ།
en: Samṛddhi (Great Prosperity)

source: ཆོས་ཀྱི་དཔལ།
en: Dharmaśrī (Glory of the Dharma)

source: ཁྱབ་འཇུག་ལ་བརྟེན་མ།
en: Mādhavāśrayā (She who Relies on Viṣṇu)

source: ཀུ་མུ་ད་ལ་གནས་མ།
en: Kusumanilayā (She whose Abode is the Flowers)

source: དག་བྱེད་དང་བཀྲ་ཤིས་ཐམས་ཅད་ཀྱི་ལག་པ་དང་ལྡན་པ།
en: Sarvapavitragātrā (She whose Body is Entirely Pure), Maṅgalahastā (She whose Hands are Auspicious)

source: མཐུ་རྩལ་གྱི་གནས།
en: Puruṣa­kārā­śrayā (She who Relies on Virile Action)

source: བཟོད་ལྡན་མ།
en: Anasūyā (She who is not Spiteful)

source: བཀྲ་མི་ཤིས་པ་ཐམས་ཅད་མེད་པར་བྱེད་པ་བསོད་ནམས་ཐམས་ཅད་སྡུད་པའི་དཔལ།
en: Sarvālakṣmī­nāśayitrī (She who Destroys All Inauspiciousness), Sarva­puṇyākarṣaṇa­śrī (Glory that Collects All Merits)

source: ས་ཐམས་ཅད་དང་། རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་དཔལ།
en: Sarva­pṛthivī­śrī (Glory of the Entire Earth), Sarvarājaśrī (Glory of All Kings)

source: རིག་སྔགས་འཆང་གི་རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་དཔལ།
en: Sarva­vidyā­dhara­rāja­śrī (Glory of the King of All Vidyādharas)

source: འབྱུང་པོ་ཐམས་ཅད་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། གྲུལ་བུམ་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་ཐམས་ཅད་ཀྱི་དཔལ།
en: Sarva­bhūta­yakṣa­rākṣasa­preta­piśāca­kuṃbhāṇḍa­mahoraga­śrī (Glory of All Bhūtas, Yakṣas, Rākṣasas, Pretas, Piśācas, Kumbhāṇḍas and Mahoragas)

source: ཆོས་ཀྱི་རྒྱལ་པོའི་དཔལ།
en: Dharmarājaśrī (Glory of the Dharma King)

source: ཀུ་བེ་རའི་སྙིང་དུ་སྡུག་མ།
en: Kuberakāntā (Beloved of Kubera)

source: སིམ་པར་བྱེད་མ།
en: Sukhakarī (She who Causes Happiness)

source: ཡིད་དུ་འོང་མ།
en: Rūpavatī (Beautiful One)

source: དཔལ་གྱི་མཆོག་མིའམ་ཅི་མོ་ཐམས་ཅད་དང་ལྷ་མ་ཡིན་མོ་ཐམས་ཅད་ཀྱི་དཔལ་གྱི་མཆོག
en: Sarva­kiṃnara­sarvāsuryottama­śrī (Glory that is the First of All Kiṃnaras and of All Asuras)

source: །ཁ་ན་མ་ཐོ་བ་མེད་པའི་གནས་ན་འདུག་མ།
en: Nir­avadya­sthāna­vāsinī (She who Stays Irreproachable)

source: དྲང་སྲོང་ཐམས་ཅད་དག་པར་བྱེད་པའི་དཔལ།
en: Sarva­rṣi­pavitra­śrī (Glory that is the Purity of All Seers)

source: སྐལ་བ་དང་ལྡན་པར་འདོད་པ།
en: Pramoda­bhāgya­lolā (She who Longs for Delight and Happiness)

source: འོད་ལ་དགའ་བ།
en: Dyuti (Splendour)

source: བཀྲ་ཤིས་ཐམས་ཅད་ཀྱི་དཔལ།
en: Sarvaśrī (Glory of All)

source: སྡུག་བསྔལ་ཐམས་ཅད་ལས་རྣམ་པར་གཟིགས་ཤིག །སྒྲོལ་ཅིག་ཐར་བར་མཛོད་ཅིག
en: Look at us, save us, and emancipate us from all sufferings.

source: །བསོད་ནམས་ཀྱི་ཚོགས་ཐམས་ཅད་བདག་ལ་མངོན་དུ་གྱུར་པར་མཛོད་ཅིག་
en: Make us turn in the direction of all collections of merits,

source: གང་ལ་ལ་ལྷ་མོ་ཆེན་མོ་དཔལ་གྱི་མིང་ཉེས་སྡིག་ཐམས་ཅད་མེད་པར་བྱེད་པ། སྡིག་པ་ཐམས་ཅད་འཇོམས་པར་བྱེད་པ།
en: these names of Śrī Mahādevī—which eliminate all offenses, overcome all sins,

source: བསོད་ནམས་ཐམས་ཅད་སྡུད་པར་བྱེད་པ། བཀྲ་མི་ཤིས་པ་ཐམས་ཅད་མེད་པར་བྱེད་པ། དཔལ་དང་། བདེ་བ་དང་། སྐལ་བ་བཟང་པོ་ཐམས་ཅད་སྡུད་པར་བྱེད་པ་འདི་དག་དང་།
en: accumulate all merits, eliminate all inauspiciousness, and accumulate all glories, happiness and good fortunes

source: འཇིགས་པ་མེད་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་
en: Fearless Avalokiteśvara
